nxp-mcuxpresso/mcux-sdk-examples/frdmk28fa/component_examples/flexio_mcu_lcd/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitPins(void)
{
    /* Port A Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortA);
    /* Port C Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortC);
    /* Port D Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortD);
    /* Port E Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortE);

    gpio_pin_config_t gpioa_pinM9_config = {.pinDirection = kGPIO_DigitalInput, .outputLogic = 0U};
    /* Initialize GPIO functionality on pin PTA2 (pin M9)  */
    GPIO_PinInit(GPIOA, 2U, &gpioa_pinM9_config);

    gpio_pin_config_t gpioa_pinN10_config = {.pinDirection = kGPIO_DigitalOutput, .outputLogic = 0U};
    /* Initialize GPIO functionality on pin PTA5 (pin N10)  */
    GPIO_PinInit(GPIOA, 5U, &gpioa_pinN10_config);

    gpio_pin_config_t gpioa_pinM10_config = {.pinDirection = kGPIO_DigitalOutput, .outputLogic = 0U};
    /* Initialize GPIO functionality on pin PTA6 (pin M10)  */
    GPIO_PinInit(GPIOA, 6U, &gpioa_pinM10_config);

    gpio_pin_config_t gpioa_pinK7_config = {.pinDirection = kGPIO_DigitalInput, .outputLogic = 0U};
    /* Initialize GPIO functionality on pin PTA21 (pin K7)  */
    GPIO_PinInit(GPIOA, 21U, &gpioa_pinK7_config);

    gpio_pin_config_t USB0_CLKIN_config = {.pinDirection = kGPIO_DigitalOutput, .outputLogic = 0U};
    /* Initialize GPIO functionality on pin PTA22 (pin K8)  */
    GPIO_PinInit(BOARD_USB0_CLKIN_GPIO, BOARD_USB0_CLKIN_PIN, &USB0_CLKIN_config);

    /* PORTA10 (pin N11) is configured as FXIO0_D16 */
    PORT_SetPinMux(PORTA, 10U, kPORT_MuxAlt5);

    /* PORTA11 (pin M11) is configured as FXIO0_D17 */
    PORT_SetPinMux(BOARD_USB_ID_PORT, BOARD_USB_ID_PIN, kPORT_MuxAlt5);

    /* PORTA12 (pin L12) is configured as FXIO0_D18 */
    PORT_SetPinMux(PORTA, 12U, kPORT_MuxAlt5);

    /* PORTA13 (pin L11) is configured as FXIO0_D19 */
    PORT_SetPinMux(PORTA, 13U, kPORT_MuxAlt5);

    /* PORTA14 (pin K13) is configured as FXIO0_D20 */
    PORT_SetPinMux(PORTA, 14U, kPORT_MuxAlt5);

    /* PORTA15 (pin K12) is configured as FXIO0_D21 */
    PORT_SetPinMux(PORTA, 15U, kPORT_MuxAlt5);

    /* PORTA16 (pin J13) is configured as FXIO0_D22 */
    PORT_SetPinMux(PORTA, 16U, kPORT_MuxAlt5);

    /* PORTA17 (pin J12) is configured as FXIO0_D23 */
    PORT_SetPinMux(PORTA, 17U, kPORT_MuxAlt5);

    /* PORTA2 (pin M9) is configured as PTA2 */
    PORT_SetPinMux(PORTA, 2U, kPORT_MuxAsGpio);

    const port_pin_config_t porta20_pinL7_config = {/* Internal pull-up resistor is enabled */
                                                    kPORT_PullUp,
                                                    /* Slow slew rate is configured */
                                                    kPORT_SlowSlewRate,
                                                    /* Passive filter is disabled */
                                                    kPORT_PassiveFilterDisable,
                                                    /* Open drain is disabled */
                                                    kPORT_OpenDrainDisable,
                                                    /* Low drive strength is configured */
                                                    kPORT_LowDriveStrength,
                                                    /* Pin is configured as FXIO0_D8 */
                                                    kPORT_MuxAlt5,
                                                    /* Pin Control Register fields [15:0] are not locked */
                                                    kPORT_UnlockRegister};
    /* PORTA20 (pin L7) is configured as FXIO0_D8 */
    PORT_SetPinConfig(PORTA, 20U, &porta20_pinL7_config);

    /* PORTA21 (pin K7) is configured as PTA21 */
    PORT_SetPinMux(PORTA, 21U, kPORT_MuxAsGpio);

    const port_pin_config_t USB0_CLKIN = {/* Internal pull-up resistor is enabled */
                                          kPORT_PullUp,
                                          /* Fast slew rate is configured */
                                          kPORT_FastSlewRate,
                                          /* Passive filter is disabled */
                                          kPORT_PassiveFilterDisable,
                                          /* Open drain is disabled */
                                          kPORT_OpenDrainDisable,
                                          /* Low drive strength is configured */
                                          kPORT_LowDriveStrength,
                                          /* Pin is configured as PTA22 */
                                          kPORT_MuxAsGpio,
                                          /* Pin Control Register fields [15:0] are not locked */
                                          kPORT_UnlockRegister};
    /* PORTA22 (pin K8) is configured as PTA22 */
    PORT_SetPinConfig(BOARD_USB0_CLKIN_PORT, BOARD_USB0_CLKIN_PIN, &USB0_CLKIN);

    const port_pin_config_t porta23_pinL8_config = {/* Internal pull-up resistor is enabled */
                                                    kPORT_PullUp,
                                                    /* Slow slew rate is configured */
                                                    kPORT_SlowSlewRate,
                                                    /* Passive filter is disabled */
                                                    kPORT_PassiveFilterDisable,
                                                    /* Open drain is disabled */
                                                    kPORT_OpenDrainDisable,
                                                    /* Low drive strength is configured */
                                                    kPORT_LowDriveStrength,
                                                    /* Pin is configured as FXIO0_D7 */
                                                    kPORT_MuxAlt5,
                                                    /* Pin Control Register fields [15:0] are not locked */
                                                    kPORT_UnlockRegister};
    /* PORTA23 (pin L8) is configured as FXIO0_D7 */
    PORT_SetPinConfig(PORTA, 23U, &porta23_pinL8_config);

    /* PORTA5 (pin N10) is configured as PTA5 */
    PORT_SetPinMux(PORTA, 5U, kPORT_MuxAsGpio);

    const port_pin_config_t porta6_pinM10_config = {/* Internal pull-up resistor is enabled */
                                                    kPORT_PullUp,
                                                    /* Fast slew rate is configured */
                                                    kPORT_FastSlewRate,
                                                    /* Passive filter is disabled */
                                                    kPORT_PassiveFilterDisable,
                                                    /* Open drain is disabled */
                                                    kPORT_OpenDrainDisable,
                                                    /* Low drive strength is configured */
                                                    kPORT_LowDriveStrength,
                                                    /* Pin is configured as PTA6 */
                                                    kPORT_MuxAsGpio,
                                                    /* Pin Control Register fields [15:0] are not locked */
                                                    kPORT_UnlockRegister};
    /* PORTA6 (pin M10) is configured as PTA6 */
    PORT_SetPinConfig(PORTA, 6U, &porta6_pinM10_config);

