nxp-mcuxpresso/mcux-sdk-examples/frdmk28fa/component_examples/flexio_mcu_lcd/pin_mux.c
    const port_pin_config_t porta8_pinK9_config = {/* Internal pull-up/down resistor is disabled */
                                                   kPORT_PullDisable,
                                                   /* Fast slew rate is configured */
                                                   kPORT_FastSlewRate,
                                                   /* Passive filter is disabled */
                                                   kPORT_PassiveFilterDisable,
                                                   /* Open drain is enabled */
                                                   kPORT_OpenDrainEnable,
                                                   /* Low drive strength is configured */
                                                   kPORT_LowDriveStrength,
                                                   /* Pin is configured as I2C1_SCL */
                                                   kPORT_MuxAlt2,
                                                   /* Pin Control Register fields [15:0] are not locked */
                                                   kPORT_UnlockRegister};
    /* PORTA8 (pin K9) is configured as I2C1_SCL */
    PORT_SetPinConfig(PORTA, 8U, &porta8_pinK9_config);

    const port_pin_config_t porta9_pinK10_config = {/* Internal pull-up/down resistor is disabled */
                                                    kPORT_PullDisable,
                                                    /* Fast slew rate is configured */
                                                    kPORT_FastSlewRate,
                                                    /* Passive filter is disabled */
                                                    kPORT_PassiveFilterDisable,
                                                    /* Open drain is enabled */
                                                    kPORT_OpenDrainEnable,
                                                    /* Low drive strength is configured */
                                                    kPORT_LowDriveStrength,
                                                    /* Pin is configured as I2C1_SDA */
                                                    kPORT_MuxAlt2,
                                                    /* Pin Control Register fields [15:0] are not locked */
                                                    kPORT_UnlockRegister};
    /* PORTA9 (pin K10) is configured as I2C1_SDA */
    PORT_SetPinConfig(PORTA, 9U, &porta9_pinK10_config);

    /* PORTC24 (pin B7) is configured as LPUART0_TX */
    PORT_SetPinMux(BOARD_DEBUG_UART_TX_PORT, BOARD_DEBUG_UART_TX_PIN, kPORT_MuxAlt3);

    /* PORTC25 (pin A7) is configured as LPUART0_RX */
    PORT_SetPinMux(BOARD_DEBUG_UART_RX_PORT, BOARD_DEBUG_UART_RX_PIN, kPORT_MuxAlt3);

    /* PORTD10 (pin D3) is configured as FXIO0_D26 */
    PORT_SetPinMux(PORTD, 10U, kPORT_MuxAlt7);

    /* PORTD11 (pin C2) is configured as FXIO0_D27 */
    PORT_SetPinMux(PORTD, 11U, kPORT_MuxAlt7);

    /* PORTD12 (pin B2) is configured as FXIO0_D28 */
    PORT_SetPinMux(PORTD, 12U, kPORT_MuxAlt7);

    /* PORTD13 (pin B3) is configured as FXIO0_D29 */
    PORT_SetPinMux(PORTD, 13U, kPORT_MuxAlt7);

    /* PORTD14 (pin A2) is configured as FXIO0_D30 */
    PORT_SetPinMux(PORTD, 14U, kPORT_MuxAlt7);

    /* PORTD15 (pin A3) is configured as FXIO0_D31 */
    PORT_SetPinMux(PORTD, 15U, kPORT_MuxAlt7);

    /* PORTD8 (pin D5) is configured as FXIO0_D24 */
    PORT_SetPinMux(PORTD, 8U, kPORT_MuxAlt7);

    /* PORTD9 (pin D4) is configured as FXIO0_D25 */
    PORT_SetPinMux(PORTD, 9U, kPORT_MuxAlt7);

    /* PORTE0 (pin A1) is configured as QSPI0A_DATA3 */
    PORT_SetPinMux(BOARD_QSPIA_DATA3_PORT, BOARD_QSPIA_DATA3_PIN, kPORT_MuxAlt5);

    /* PORTE1 (pin B1) is configured as QSPI0A_SCLK */
    PORT_SetPinMux(BOARD_QSPIA_SCLK_PORT, BOARD_QSPIA_SCLK_PIN, kPORT_MuxAlt5);

    /* PORTE2 (pin C1) is configured as QSPI0A_DATA0 */
    PORT_SetPinMux(BOARD_QSPIA_DATA0_PORT, BOARD_QSPIA_DATA0_PIN, kPORT_MuxAlt5);

    /* PORTE3 (pin D1) is configured as QSPI0A_DATA2 */
    PORT_SetPinMux(BOARD_QSPIA_DATA2_PORT, BOARD_QSPIA_DATA2_PIN, kPORT_MuxAlt5);

    /* PORTE4 (pin E1) is configured as QSPI0A_DATA1 */
    PORT_SetPinMux(BOARD_QSPIA_DATA1_PORT, BOARD_QSPIA_DATA1_PIN, kPORT_MuxAlt5);

    /* PORTE5 (pin D2) is configured as QSPI0A_SS0_B */
    PORT_SetPinMux(BOARD_QSPIA_SS_PORT, BOARD_QSPIA_SS_PIN, kPORT_MuxAlt5);

    SIM->SOPT5 = ((SIM->SOPT5 &
                   /* Mask bits to zero which are setting */
                   (~(SIM_SOPT5_LPUART0TXSRC_MASK | SIM_SOPT5_LPUART0RXSRC_MASK)))

                  /* LPUART0 transmit data source select: LPUART0_TX pin. */
                  | SIM_SOPT5_LPUART0TXSRC(SOPT5_LPUART0TXSRC_LPUART_TX)

                  /* LPUART0 receive data source select: LPUART0_RX pin. */
                  | SIM_SOPT5_LPUART0RXSRC(SOPT5_LPUART0RXSRC_LPUART_RX));
}
/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
